# ReferenceArrayArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceArrayArray Class
Members See Also
---
An array that contains ReferenceArray objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ReferenceArrayArray : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class ReferenceArrayArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class ReferenceArrayArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ReferenceArrayArray
# See Also
ReferenceArrayArray Members
Autodesk.Revit.DB Namespace